app/views/static/index.html.erb

		<td style="white-space: nowrap; width: 50px;"><%= log.created_at.strftime("%b %d") %><br /><%= log.created_at.strftime("%Y") %></td>
		<td><%= link_to log.title, log %><br /><a href="logs/<%= log.token %>#comments"><small class="muted"><%= log.comments.count.to_s %> <%= log.comments.count.to_i == 1 ? "comment" : "comments" %></small></a></td>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."log_id" IS NULL