app/controllers/logs_controller.rb

    def index
			can_see_priv = !!(user_signed_in? and current_user.role? :admin)
    	@logs = apply_scopes(Log.select('creator,owner,category,game,author,title,private,token,created_at'))
			if !can_see_priv
				@logs = @logs.where(:private => false)
			end
			@logs = @logs.paginate(:page => params[:page], :per_page => 25)
    	@games = Hash[Game.all.collect {|g| [g.id, g.name] }.push([0, "Other"])]
    	@categories = Hash[Category.all.collect {|c| [c.id, c.name] }.push([0, "Other"])]
---
SELECT COUNT(*) FROM "logs" WHERE "logs"."private" = 'f'
SELECT creator,owner,category,game,author,title,private,token,created_at FROM "logs" WHERE "logs"."private" = 'f' ORDER BY created_at DESC LIMIT 25 OFFSET 0
SELECT "games".* FROM "games"
SELECT "categories".* FROM "categories"

	def show
		@log = Log.find_by_token(params[:id]) || not_found
		@games = Hash[Game.all.collect {|g| [g.id, g.name] }.push([0, "Other"])]
---
SELECT "logs".* FROM "logs" WHERE "logs"."token" = '2alLh' LIMIT 1
SELECT "games".* FROM "games"

                        params[:log].delete(:file)
                @log = Log.new(params[:log])

                if @log.save
---
INSERT INTO "logs" ("author", "category", "contents", "created_at", "creator", "description", "downloadable", "game", "owner", "private", "title", "token", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

	def destroy
		@log = Log.find_by_token(params[:id])
		authorize! :destroy, @log
		@log.destroy
---
SELECT "logs".* FROM "logs" WHERE "logs"."token" = '2alLh' LIMIT 1
DELETE FROM "logs" WHERE "logs"."id" = ?  [["id", 1]]

	def comment
		params[:comment][:modpost] = params[:comment][:modpost] or false
		@log = Log.find_by_token(params[:id])
		@log.comments.create(params[:comment])
---
SELECT "logs".* FROM "logs" WHERE "logs"."token" = 'veEZf' LIMIT 1
INSERT INTO "comments" ("author", "body", "created_at", "creator", "log_id", "modpost", "owner", "reply", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

	def feed
		# this will be the name of the feed displayed on the feed reader
		@title = "CocoLog"

		# the news items
		@logs = Log.where(:private => false).order("created_at desc")

		# this will be our Feed's update timestamp
		@updated = @logs.first.created_at unless @logs.empty?

		@games = Hash[Game.all.collect {|g| [g.id, g.name] }.push([0, "Other"])]
		@categories = Hash[Category.all.collect {|c| [c.id, c.name] }.push([0, "Other"])]
---
SELECT "logs".* FROM "logs" WHERE "logs"."private" = 'f' ORDER BY created_at desc
SELECT COUNT(*) FROM "logs" WHERE "logs"."private" = 'f'
SELECT "games".* FROM "games"
SELECT "categories".* FROM "categories"