app/controllers/static_controller.rb

SELECT creator,owner,category,game,author,title,private,token,created_at FROM "logs" WHERE "logs"."private" = 'f' ORDER BY created_at DESC LIMIT 10
SELECT "games".* FROM "games"
SELECT "categories".* FROM "categories"
---
  def index
    @logs = Log.select('creator,owner,category,game,author,title,private,token,created_at').where(:private => false).order("created_at DESC").limit(10)
    @games = Hash[Game.all.collect {|g| [g.id, g.name] }.push([0, "Other"])]
    @categories = Hash[Category.all.collect {|c| [c.id, c.name] }.push([0, "Other"])]