app/controllers/users_controller.rb

SELECT "logs".* FROM "logs" WHERE "logs"."owner" = 1
SELECT "games".* FROM "games"
SELECT "categories".* FROM "categories"
---
	def profile
		render :status => :forbidden unless user_signed_in?
		@user = current_user
		authorize! :edit, @user
		@logs = Log.where(:owner => @user.id)
 		@games = Hash[Game.all.collect {|g| [g.id, g.name] }.push([0, "Other"])]
		@categories = Hash[Category.all.collect {|c| [c.id, c.name] }.push([0, "Other"])]