app/views/logs/index.html.erb

SELECT "categories".* FROM "categories"
---
              <option value=""></option>
              <% Category.all.each do |cat| %>

SELECT "games".* FROM "games"
---
                <option value=""></option>
                <% Game.all.each do |game| %>

SELECT COUNT(*) FROM "comments" WHERE "comments"."log_id" IS NULL
SELECT COUNT(*) FROM "logs" WHERE "logs"."private" = 'f'
---
	<td class="date"><%= log.created_at.strftime("%b %d") %><br /><%= log.created_at.strftime("%Y") %></td>
        <td class="title"><%= link_to log.title, log %> <% if log.private %><span style="color:red">(private)</span><% end %><br /><a href="logs/<%= log.token %>#comments"><small class="muted"><%= log.comments.count.to_s %> <%= log.comments.count.to_i == 1 ? "comment" : "comments" %></small></a></td>