app/views/logs/new.html.erb

SELECT "games".* FROM "games"
---
		<div class="controls">
			<%= select("log", "game", Game.all.collect {|g| [ g.name, g.id ] }.push(["Other", 0]), {}) %>

SELECT "categories".* FROM "categories"
---
		<div class="controls">
			<%= select("log", "category", Category.all.collect {|c| [ c.name, c.id ] }.push(["Other", 0]), {}) %>