app/views/logs/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."log_id" = 1
SELECT COUNT(*) FROM "comments" WHERE "comments"."log_id" = 1
---
	<div class="logbuttons pull-right">
	<a href="#comments"><span class="label"><%= @log.comments.count %> Comments</span></a>

SELECT "games".* FROM "games"
---
		<p><%= @log.description %></p>
		<small><%= @log.author.empty? ? "Anonymous" : @log.author %> of <%= @games[@log.game].to_s %></small>